puertos_routes.xml

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">

  <SOAP:Header>

    <header xmlns="xmlapi_1.0">

      <security>

        <user>oss_user</user>

        <password>c36b885125105c462d34774140eec076</password>

      </security>

      <requestID>client1:0</requestID>

    </header>

  </SOAP:Header>

  <SOAP:Body>

    <find xmlns="xmlapi_1.0">

      <fullClassName>equipment.PhysicalPort</fullClassName>

      <resultFilter>

        <attribute>objectFullName</attribute>

        <attribute>siteId</attribute>

        <attribute>siteName</attribute>

        <attribute>portName</attribute>

        <attribute>speed</attribute>

        <attribute>actualSpeed</attribute>

        <children/>

      </resultFilter>

    </find>

  </SOAP:Body>

</SOAP:Envelope>